package com.example.data.withouthttp

import com.example.data.model.Address
import com.example.data.model.Experience
import com.example.data.model.IntVacancie1
import com.example.data.model.Salary

val listOfNetworkVacancie = listOf(
    IntVacancie1(
        Address("4/5", "улица Бирюзова", "Минск"),
        147,
        "Мобирикс",
        "Мы ищем специалиста на позицию UX/UI Designer, который вместе с коллегами " +
                "будет заниматься проектированием пользовательских интерфейсов внутренних " +
                "и внешних продуктов компании.",
        Experience("Опыт от 1 до 3 лет", "1–3 года"),
        1,
        false,
        2,
        "2024-02-20",
        listOf(
            "Где располагается место работы?",
            "Какой график работы?",
            "Вакансия открыта?",
            "Какая оплата труда?"
        ),
        "- проектирование пользовательских сценариев и создание прототипов;" +
                "\n- разработка интерфейсов для продуктов компании (Web+App);" +
                "\n- работа над созданием и улучшением Дизайн-системы;" +
                "\n- взаимодействие с командами frontend-разработки;" +
                "\n- контроль качества внедрения дизайна;\n- ситуативно: создание презентаций" +
                " и других материалов на основе фирменного стиля компании",
        Salary("Уровень дохода не указан",""),
        listOf("полная занятость", "полный день"),
        "UI/UX дизайнер"
    ),
    IntVacancie1(
        Address(
            "4/5", "улица Бирюзова", "Минск"
        ),
        147,
        "Мобирикс",
        "Мы ищем специалиста на позицию UX/UI Designer, который вместе с коллегами " +
                "будет заниматься проектированием пользовательских интерфейсов внутренних " +
                "и внешних продуктов компании.",
        Experience(
            "Опыт от 1 до 3 лет", "1–3 года"
        ),
        2,
        true,
        2,
        "2024-02-20",
        listOf(
            "Где располагается место работы?",
            "Какой график работы?",
            "Вакансия открыта?",
            "Какая оплата труда?"
        ),
        "- проектирование пользовательских сценариев и создание прототипов;" +
                "\n- разработка интерфейсов для продуктов компании (Web+App);" +
                "\n- работа над созданием и улучшением Дизайн-системы;" +
                "\n- взаимодействие с командами frontend-разработки;" +
                "\n- контроль качества внедрения дизайна;\n- ситуативно: создание презентаций" +
                " и других материалов на основе фирменного стиля компании",
        Salary(
            "Уровень дохода не указан",
            ""
        ),
        listOf("полная занятость", "полный день"),
        "UI/UX дизайнер"
    ),
    IntVacancie1(
        Address("4/5", "улица Бирюзова", "Минск"),
        147,
        "Мобирикс",
        "Мы ищем специалиста на позицию UX/UI Designer, который вместе с коллегами " +
                "будет заниматься проектированием пользовательских интерфейсов внутренних " +
                "и внешних продуктов компании.",
        Experience("Опыт от 1 до 3 лет", "1–3 года"),
        3,
        false,
        2,
        "2024-02-20",
        listOf(
            "Где располагается место работы?",
            "Какой график работы?",
            "Вакансия открыта?",
            "Какая оплата труда?"
        ),
        "- проектирование пользовательских сценариев и создание прототипов;" +
                "\n- разработка интерфейсов для продуктов компании (Web+App);" +
                "\n- работа над созданием и улучшением Дизайн-системы;" +
                "\n- взаимодействие с командами frontend-разработки;" +
                "\n- контроль качества внедрения дизайна;\n- ситуативно: создание презентаций" +
                " и других материалов на основе фирменного стиля компании",
        Salary("Уровень дохода не указан",""),
        listOf("полная занятость", "полный день"),
        "UI/UX дизайнер"
    ),
    IntVacancie1(
        Address(
            "4/5", "улица Бирюзова", "Минск"
        ),
        147,
        "Мобирикс",
        "Мы ищем специалиста на позицию UX/UI Designer, который вместе с коллегами " +
                "будет заниматься проектированием пользовательских интерфейсов внутренних " +
                "и внешних продуктов компании.",
        Experience(
            "Опыт от 1 до 3 лет", "1–3 года"
        ),
        4,
        false,
        2,
        "2024-02-20",
        listOf(
            "Где располагается место работы?",
            "Какой график работы?",
            "Вакансия открыта?",
            "Какая оплата труда?"
        ),
        "- проектирование пользовательских сценариев и создание прототипов;" +
                "\n- разработка интерфейсов для продуктов компании (Web+App);" +
                "\n- работа над созданием и улучшением Дизайн-системы;" +
                "\n- взаимодействие с командами frontend-разработки;" +
                "\n- контроль качества внедрения дизайна;\n- ситуативно: создание презентаций" +
                " и других материалов на основе фирменного стиля компании",
        Salary(
            "Уровень дохода не указан",
            ""
        ),
        listOf("полная занятость", "полный день"),
        "UI/UX дизайнер"
    )
)