package com.example.data.withouthttp

import com.example.data.Vacancies

val listOfVacancies= listOf(
    Vacancies(
        "cbf0c984-7c6c-4ada-82da-e29dc698bb50",
        "2",
        "UI/UX дизайнер",
        "Минск",
        "улица Бирюзова",
        "4/5",
        "Мобирикс",
        "Опыт от 1 до 3 лет",
        "1–3 года",
        "2024-02-20",
        "false",
        "",
        "Уровень дохода не указан",
        "полная занятость, полный день",
        "147",
        "Мы ищем специалиста на позицию UX/UI Designer, который вместе с коллегами " +
                "будет заниматься проектированием пользовательских интерфейсов внутренних и внешних продуктов компании.",
        "- проектирование пользовательских сценариев и создание прототипов;" +
                "\n- разработка интерфейсов для продуктов компании (Web+App);" +
                "\n- работа над созданием и улучшением Дизайн-системы;" +
                "\n- взаимодействие с командами frontend-разработки;" +
                "\n- контроль качества внедрения дизайна;\n- ситуативно: создание презентаций" +
                " и других материалов на основе фирменного стиля компании",
        "Где располагается место работы?, Какой график работы?, Вакансия открыта?, Какая оплата труда?"
    ),
    Vacancies(
        "54a876a5-2205-48ba-9498-cfecff4baa6e",
        "17",
        "UI/UX-дизайнер / Web-дизайнер / Дизайнер интерфейсов",
        "Казань",
        "улица Чистопольская",
        "20/10",
        "Шафигуллин Шакир",
        "Опыт от 1 до 3 лет",
        "1–3 года",
        "2024-03-06",
        "false",
        "20 000 до 50 000 ₽",
        "от 20 000 до 50 000 ₽ на руки",
        "частичная занятость, полный день",
        "",
        "Мы разрабатываем мобильные приложения, web-приложения и сайты под ключ." +
                "\n\nНам в команду нужен UX/UI Designer!",
        "- Разработка дизайна Web+App (обязательно Figma)\n\n- Работа над созданием" +
                " и улучшением систем;\n\n- Взаимодействие с командами frontend-разработки и backend-разработки",
        "Где располагается место работы?, Какой график работы?, Как с вами связаться?"
    ),
    Vacancies(
        "75c84407-52e1-4cce-a73a-ff2d3ac031b3",
        "",
        "UX/UI Designer",
        "Казань",
        "улица Пушкина",
        "2",
        "Aston",
        "Опыт от 3 до 6 лет",
        "3–6 лет",
        "2024-02-28",
        "true",
        "",
        "Уровень дохода не указан",
        "полная занятость, удаленная работа",
        "11",
        "Мы – аутсорсинговая аккредитованная IT-компания Aston, разрабатываем " +
                "программное обеспечение на заказ и оказываем услуги IT-аутсорсинга " +
                "предприятиям, организациям и стартапам. Приоритетные направления – финансовые " +
                "технологии, телеком, ритейл, недвижимость и другие. Среди наших клиентов " +
                "– компании Тинькофф, Х5 Retail Group, Банки.ру, ВТБ Банк, Альфа Банк, " +
                "Цифра и другие.\n\nЗаказчик входит в топ-10 российских банков по величине" +
                " активов, кредитного портфеля, размеру средств, привлеченных от" +
                " клиентов, и нормативного капитала.\n\nБанк активно развивает онлайн-сервисы " +
                "и работает по стратегии Mobile first. В компании есть отдельное " +
                "подразделение, в котором создаются digital-продукты и внедряются цифровые технологии.",
        "- совместно с Product Owner определять бизнес-метрики, потребности " +
                "клиентов банка, фиксировать их в формате задач и метрик успешности;\n- изучать" +
                " лучшие практики и недостатки аналогичных продуктов, проходить путь " +
                "клиента и формулировать гипотезы решения задач вместе с продуктовой " +
                "командой;\n- создавать прототипы для проверки гипотез;\n- передавать " +
                "прототипы на Usability-тесты и контролировать их проведение;\n- улучшать " +
                "решения по результатам тестов и наблюдений;\n- готовить чистовые макеты на " +
                "основе компонентов дизайн-системы банка для передачи в разработку;\n- " +
                "создавать и описывать новые компоненты дизайн-системы по принятым в банке " +
                "стандартам;\n- отдавать на дизайн-чек макеты и проверять решения других " +
                "дизайнеров;\n- передавать макеты разработчикам и отвечать на возникающие в " +
                "процессе разработки вопросы;\n- проводить дизайн-ревью результата разработки" +
                " и формулировать список замечаний для разработчиков;\n- итеративно " +
                "совершенствовать дизайн цифрового продукта на основе метрик и отзывов " +
                "клиентов;\n- участвовать в улучшении процессов центра компетенций продуктового дизайна.",
        "Где располагается место работы?, Какой график работы?, Какая оплата труда?"
    ),
    Vacancies(
        "16f88865-ae74-4b7c-9d85-b68334bb97db",
        "57",
        "Веб-дизайнер",
        "Казань",
        "улица Пушкина",
        "57",
        "Алабуга. Маркетинг и PR",
        "Без опыта",
        "не требуется",
        "2024-03-02",
        "false",
        "от 60 000 ₽",
        "от 60 000 ₽ до вычета налогов",
        "частичная занятость, полный день",
        "7",
        "",
        "- Разработка новых сайтов, приложений, лэндингов;\n- Создание и доработка" +
                " прототипов готовых к сдаче в верстку;\n- Взаимодействие с подрядчиками " +
                "по разработке сайтов\n- Доработка существующих сайтов;\n- Проектирование " +
                "интерфейсов, организация UI/UX-исследований;\n- Взаимодействие с Frontend " +
                "и Backend разработчиками, техническими специалистами;\n- Работа с дизайн системой, её поддержание.",
        "Где располагается место работы?, Какой график работы?, Вакансия открыта?, Какая оплата труда?"
    ),
    Vacancies(
        "26f88856-ae74-4b7c-9d85-b68334bb97db",
        "29",
        "Ведущий продуктовый дизайнер",
        "Минск",
        "проспект Хасанова",
        "15",
        "ПАО Ростелеком",
        "Опыт от 3 до 6 лет",
        "3–6 лет",
        "2024-02-19",
        "false",
        "",
        "Уровень дохода не указан",
        "полная занятость, удаленная работа",
        "",
        "Перед вами не просто вакансия. Перед вами — уникальные возможности, " +
                "от которых вас отделяет всего один клик.",
        "— Готовить макеты на основании прототипа и/или описания пользовательских " +
                "сценариев;\n— Анализировать бизнесовые и пользовательские требования, " +
                "уточнять постановки от аналитиков и проектировщиков;\n— Создавать " +
                "графические и стилистические элементы для портала, приложений и промо " +
                "страниц;\n— Оптимизировать дизайн существующих интерфейсов;\n— " +
                "Осуществлять авторский контроль над исполнителями;\n— Развивать " +
                "существующую дизайн-систему и UI-киты;\n— Помогать в подготовке продающих фичи презентаций.",
        "Где располагается место работы?, Какой график работы?, Вакансия открыта?, Какая оплата труда?"
    ),
    Vacancies(
        "15f88865-ae74-4b7c-9d81-b78334bb97db",
        "1",
        "Product Designer",
        "Минск",
        "улица Побратимова",
        "5",
        "TravelLine",
        "Опыт от 3 до 6 лет",
        "3–6 лет",
        "2024-02-02",
        "false",
        "",
        "Уровень дохода не указан",
        "полная занятость, полный день",
        "1",
        "В TravelLine мы разрабатываем единую функциональную Платформу для " +
                "автоматизации процессов гостиничного бизнеса. Всё, что связано с " +
                "онлайн-бронированием и управлением номерным фондом в отелях — это к нам. " +
                "Ежемесячно через наши системы бронируют более 1,5 миллионов гостей.\n\nМы " +
                "ищем коллегу в команду продуктовых дизайнеров на В2В продукт.\nСейчас в " +
                "нашей команде 10 продуктовых дизайнеров, которые занимаются В2В, В2С и " +
                "В2Е продуктами.\nВ начале пути у тебя будет наставник, который поможет в адаптации к новой команде.",
        "- Проектировать интерфейс B2B продукта: сопровождать и улучшать " +
                "текущие решения, поддерживать консистентность\n\n- Понимать потребности " +
                "и боли пользователей, логику взаимодействия пользователя с продуктом, " +
                "участвовать в этапе discovery\n\n- Создавать интерактивные прототипы\n\n- " +
                "Проводить юзабилити-тестирования и ревью реализации решений\n\n- Работать " +
                "внутри продуктовой команды: коммуницировать с дизайнерами, продакт и " +
                "проджект менеджерами, аналитиками, разработчиками и тестировщиками.",
        "Где располагается место работы?, Какой график работы?, Вакансия открыта?, Какая оплата труда?, Как с вами связаться?"
    )
)